---
title: AirSystemData
classe: Autodesk.Revit.DB.Mechanical.AirSystemData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AirSystemData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AirFanType AirFanType { get; set; }` | `airSystemData.AirFanType` | AirFanType |
| `ElementId ChilledWaterLoopId { get; set; }` | `airSystemData.ChilledWaterLoopId` | ElementId |
| `AirCoolingCoilType CoolingCoilType { get; set; }` | `airSystemData.CoolingCoilType` | AirCoolingCoilType |
| `AirHeatExchangerType HeatExchangerType { get; set; }` | `airSystemData.HeatExchangerType` | AirHeatExchangerType |
| `AirHeatingCoilType HeatingCoilType { get; set; }` | `airSystemData.HeatingCoilType` | AirHeatingCoilType |
| `ElementId HeatingHotWaterLoopId { get; set; }` | `airSystemData.HeatingHotWaterLoopId` | ElementId |
| `Boolean IsValidObject { get; }` | `airSystemData.IsValidObject` | Boolean |
| `AirHeatingCoilType PreheatCoilType { get; set; }` | `airSystemData.PreheatCoilType` | AirHeatingCoilType |
| `ElementId PreheatHotWaterLoopId { get; set; }` | `airSystemData.PreheatHotWaterLoopId` | ElementId |
| `Void Dispose()` | `airSystemData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```